Revit 2027 API
DirectShapeLibrary.Reset Method
 Removes all definitions from library. This is useful when importing several self-contained data sets within one session. Once a data set is imported, keeping the definitions specific to that data set will slow down the searches.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Reset()
Public Sub Reset
public:
void Reset()
member Reset : unit -> unit
See Also
Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace